#Denisova Ekaterina katia_kos@mail.ru
#4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

#n = input("введите целое положительное число:")
print("%.2f" % (20.0/8))
name = input("Enter your name: ")
print("Hello, %s!" % name)
