#Denisova Ekaterina katia_kos@mail.ru
#4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

#n = input("введите целое положительное число:")
#max_N = 9
#while n >= max_N:
 # print("Максимальная цифра в числe",  max_N)


